// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

int a = int.Parse(Console.ReadLine()!);
int b = int.Parse(Console.ReadLine()!);
Console.WriteLine(a % b);


//Console.WriteLine("Hello, World!");
